src/Catalogs/РабочиеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РабочиеМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СетевойПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/РабочиеМеста/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных
 
 &НаКлиенте
 Перем ЗаданВопрос;
 	
 #КонецОбласти
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Объект.СетевойПорт = 15000;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриОткрытии
//
Процедура ПриОткрытии(Отказ)
	
	#Если Не ВебКлиент Тогда
		Если ПустаяСтрока(Объект.Код) Тогда
			Объект.Код = ИмяКомпьютера();
		КонецЕсли;
	#КонецЕсли
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = ?(ПустаяСтрока(Строка(Объект.Код)), "<Имя компьютера>", Строка(Объект.Код))
		+ "/"
		+ ?(ПустаяСтрока(Строка(ТекущийПользователь)), "<Пользователь>", Строка(ТекущийПользователь));
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события ПриЧтенииНаСервере
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Место = ТекущийОбъект.Ссылка;

	СписокУстройств = МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования( , , Место);
	Для Каждого Элемент Из СписокУстройств Цикл
		Если Элемент.РабочееМесто = Место Тогда
			ЛокальноеОборудование.Добавить(Элемент.Ссылка,Элемент.Наименование, Ложь, ПолучитьКартинку(Элемент.ТипОборудования, 16));
		Иначе
			УдаленноеОборудование.Добавить(Элемент.Ссылка,Элемент.Наименование, Ложь, ПолучитьКартинку(Элемент.ТипОборудования, 16));
		КонецЕсли;
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ПроверкаУникальностиПоИдентификаторуКлиента()Тогда
		Отказ = Истина;
		Если Объект.МногопользовательскийРежим Тогда
			Текст = НСтр("ru='Ошибка сохранение рабочего места!
			|Многопользовательское рабочее место на этом компьютере уже существует.'");
		Иначе
			Текст = НСтр("ru='Ошибка сохранение рабочего места!
			|Рабочее место с таким идентификатором клиента уже существует.'");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверкаУникальностиПоНаименованию() И Не ЗаданВопрос = Истина Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект), НСтр("ru='Указано неуникальное наименование рабочего места!
		|Возможно в дальнейшем это затруднит идентификацию и выбор рабочего места.
		|Рекомендуется указывать уникальное наименование рабочих мест.
		|Продолжить сохранение с указанным наименованием?'"),
		РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаданВопрос = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Перед записью завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаданВопрос = Истина; 
		ЭтаФорма.Записать();
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Фукция возвращает картинку типа оборудования
//
Функция ПолучитьКартинку(ТипОборудования, Размер)

	Попытка // Может прийти пустая ссылка или неопределено, может не быть картинки
		МтОбъект = ТипОборудования.Метаданные();
		Индекс = Перечисления.ТипыПодключаемогоОборудования.Индекс(ТипОборудования);
		ИмяКартинки = МтОбъект.ЗначенияПеречисления[Индекс].Имя;
		ИмяКартинки = "ПодключаемоеОборудование" + ИмяКартинки + Размер;
		Картинка = Вычислить("БиблиотекаКартинок." + ИмяКартинки);
	Исключение
		Картинка = Неопределено;
	КонецПопытки;

	Возврат Картинка;

КонецФункции

&НаСервере
// Функция проверяет уникальность наименование рабочего места
//
Функция ПроверкаУникальностиПоНаименованию()

	Результат = Истина;

	Если Не ПустаяСтрока(Объект.Наименование) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	1 КАК Поле1
		                      |ИЗ
		                      |	Справочник.РабочиеМеста КАК РабочиеМеста
		                      |ГДЕ
		                      |	РабочиеМеста.Наименование = &Наименование
		                      |	И РабочиеМеста.Ссылка <> &Ссылка");

		Запрос.УстановитьПараметр("Наименование", Объект.Наименование);
		Запрос.УстановитьПараметр("Ссылка"      , Объект.Ссылка);

		Результат = Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат Результат;

КонецФункции 

&НаСервере
Функция ПроверкаУникальностиПоИдентификаторуКлиента()
	
	Результат = Истина;
	
	Если Объект.МногопользовательскийРежим Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	1 КАК Поле1
		                      |ИЗ
		                      |	Справочник.РабочиеМеста КАК РабочиеМеста
		                      |ГДЕ
		                      |	РабочиеМеста.Код = &ИмяКомпьютера
		                      |	И РабочиеМеста.Ссылка <> &Ссылка
		                      |	И РабочиеМеста.МногопользовательскийРежим");
		Запрос.УстановитьПараметр("ИмяКомпьютера", Объект.ИмяКомпьютера);
		Запрос.УстановитьПараметр("Ссылка"       , Объект.Ссылка);
		Результат = Запрос.Выполнить().Пустой();
	Иначе	
		СистемнаяИнформация = Новый СистемнаяИнформация();
		ИдентификаторКлиента = ВРег(СистемнаяИнформация.ИдентификаторКлиента);
		
		Если Не ПустаяСтрока(Объект.Код) Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|    1
			|ИЗ
			|    Справочник.РабочиеМеста КАК РабочиеМеста
			|ГДЕ
			|    РабочиеМеста.Код = &Код
			|    И РабочиеМеста.Ссылка <> &Ссылка
			|");
			Запрос.УстановитьПараметр("Код"    , ИдентификаторКлиента);
			Запрос.УстановитьПараметр("Ссылка" , Объект.Ссылка);
			Результат = Запрос.Выполнить().Пустой();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
// Процедура заполняет рекыизит объекта "Наименование"
//
Процедура ЗаполнитьНаименование()

	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = ?(ПустаяСтрока(Строка(Объект.Код)), НСтр("ru='<Имя компьютера>'"), Строка(Объект.Код))
		                    + "/"
		                    + ?(ПустаяСтрока(Строка(ТекущийПользователь)), НСтр("ru='<Пользователь>'"), Строка(ТекущийПользователь));
	ИначеЕсли Не ПустаяСтрока(Объект.Код)
	   И Найти(Объект.Наименование, НСтр("ru='<Имя компьютера>'")) > 0 Тогда
		Объект.Наименование = СтрЗаменить(Объект.Наименование, НСтр("ru='<Имя компьютера>'"), Объект.Код);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриИзменении
//
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьНаименование(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПриИзменении
//
Процедура КодПриИзменении(Элемент)
	
	Объект.Код = ВРег(Элемент.ТекстРедактирования);

	ЗаполнитьНаименование();
	
КонецПроцедуры

#КонецОбласти
